app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.rating

    # redirect_to movies_path(order: session[:order], ratings: params[:ratings]) if params[:order].nil? && params[:ratings]
    redirect_to movies_path(order: session[:order], ratings: session[:ratings]) if empty_params?

    session[:order] = params[:order] if params[:order]
    @order = session[:order]
# debugger
    if params[:ratings]
      session[:ratings] = params[:ratings]
      @ratings = session[:ratings]
      @movies = Movie.where(rating: @ratings.keys).order(@order)
    else
      session[:ratings] ||= @all_ratings
      @ratings = session[:ratings]
      @movies = Movie.order(@order)
---
SELECT "movies".* FROM "movies" WHERE "rating"."PG-13" = '1' AND "rating"."R" = '1' ORDER BY title
SELECT "movies".* FROM "movies" ORDER BY release_date DESC